-- Initial data (For only In-Memory DB)
INSERT INTO brand
    (name)
values
    ('A'), ('B'), ('C'), ('D'), ('E'), ('F'), ('G'), ('H'), ('I');

INSERT INTO category
    (name)
values
    ('상의'), ('아우터'), ('바지'), ('스니커즈'), ('가방'), ('모자'), ('양말'), ('액세서리');

INSERT INTO product
    (brand_id, category_id, name, price)
values
    (1, 1, 'A 브랜드/상의상품', 11200),
    (1, 2, 'A 브랜드/아우터상품', 5500),
    (1, 3, 'A 브랜드/바지상품', 4200),
    (1, 4, 'A 브랜드/스니커즈상품', 9000),
    (1, 5, 'A 브랜드/가방상품', 2000),
    (1, 6, 'A 브랜드/모자상품', 1700),
    (1, 7, 'A 브랜드/양말상품', 1800),
    (1, 8, 'A 브랜드/액세서리상품', 2300),

    (2, 1, 'B 브랜드/상의상품', 10500),
    (2, 2, 'B 브랜드/아우터상품', 5900),
    (2, 3, 'B 브랜드/바지상품', 3800),
    (2, 4, 'B 브랜드/스니커즈상품', 9100),
    (2, 5, 'B 브랜드/가방상품', 2100),
    (2, 6, 'B 브랜드/모자상품', 2000),
    (2, 7, 'B 브랜드/양말상품', 2000),
    (2, 8, 'B 브랜드/액세서리상품', 2200),

    (3, 1, 'C 브랜드/상의상품', 10000),
    (3, 2, 'C 브랜드/아우터상품', 6200),
    (3, 3, 'C 브랜드/바지상품', 3300),
    (3, 4, 'C 브랜드/스니커즈상품', 9200),
    (3, 5, 'C 브랜드/가방상품', 2200),
    (3, 6, 'C 브랜드/모자상품', 1900),
    (3, 7, 'C 브랜드/양말상품', 2200),
    (3, 8, 'C 브랜드/액세서리상품', 2100),

    (4, 1, 'D 브랜드/상의상품', 10100),
    (4, 2, 'D 브랜드/아우터상품', 5100),
    (4, 3, 'D 브랜드/바지상품', 3000),
    (4, 4, 'D 브랜드/스니커즈상품', 9500),
    (4, 5, 'D 브랜드/가방상품', 2500),
    (4, 6, 'D 브랜드/모자상품', 1500),
    (4, 7, 'D 브랜드/양말상품', 2400),
    (4, 8, 'D 브랜드/액세서리상품', 2000),

    (5, 1, 'E 브랜드/상의상품', 10700),
    (5, 2, 'E 브랜드/아우터상품', 5000),
    (5, 3, 'E 브랜드/바지상품', 3800),
    (5, 4, 'E 브랜드/스니커즈상품', 9900),
    (5, 5, 'E 브랜드/가방상품', 2300),
    (5, 6, 'E 브랜드/모자상품', 1800),
    (5, 7, 'E 브랜드/양말상품', 2100),
    (5, 8, 'E 브랜드/액세서리상품', 2100),

    (6, 1, 'F 브랜드/상의상품', 11200),
    (6, 2, 'F 브랜드/아우터상품', 7200),
    (6, 3, 'F 브랜드/바지상품', 4000),
    (6, 4, 'F 브랜드/스니커즈상품', 9300),
    (6, 5, 'F 브랜드/가방상품', 2100),
    (6, 6, 'F 브랜드/모자상품', 1600),
    (6, 7, 'F 브랜드/양말상품', 2300),
    (6, 8, 'F 브랜드/액세서리상품', 1900),

    (7, 1, 'G 브랜드/상의상품', 10500),
    (7, 2, 'G 브랜드/아우터상품', 5800),
    (7, 3, 'G 브랜드/바지상품', 3900),
    (7, 4, 'G 브랜드/스니커즈상품', 9000),
    (7, 5, 'G 브랜드/가방상품', 2200),
    (7, 6, 'G 브랜드/모자상품', 1700),
    (7, 7, 'G 브랜드/양말상품', 2100),
    (7, 8, 'G 브랜드/액세서리상품', 2000),

    (8, 1, 'H 브랜드/상의상품', 10800),
    (8, 2, 'H 브랜드/아우터상품', 6300),
    (8, 3, 'H 브랜드/바지상품', 3100),
    (8, 4, 'H 브랜드/스니커즈상품', 9700),
    (8, 5, 'H 브랜드/가방상품', 2100),
    (8, 6, 'H 브랜드/모자상품', 1600),
    (8, 7, 'H 브랜드/양말상품', 2000),
    (8, 8, 'H 브랜드/액세서리상품', 2000),

    (9, 1, 'I 브랜드/상의상품', 11400),
    (9, 2, 'I 브랜드/아우터상품', 6700),
    (9, 3, 'I 브랜드/바지상품', 3200),
    (9, 4, 'I 브랜드/스니커즈상품', 9500),
    (9, 5, 'I 브랜드/가방상품', 2400),
    (9, 6, 'I 브랜드/모자상품', 1700),
    (9, 7, 'I 브랜드/양말상품', 1700),
    (9, 8, 'I 브랜드/액세서리상품', 2400)
    ;